<!DOCTYPE html>
<html lang="es">

    <head>
        <style type="text/css">
            body {
                font-family: verdana;
                font-size: 100%;
                text-align: justify;
            }
            h1{
                border-bottom: 1px solid aqua;
                font-family: verdana;
            }
            h2{
                padding-top: 10px;
            }
        </style>

        <meta charset="utf-8"/>
        <title></title>
    </head>

    <body>
        <h1>Archivo</h1>

        <h2>Introducir datos</h2>
        <p> Muestra un di&aacute;logo en el que se pide el tama&ntilde;o del vector
            a ordenar  y a continuaci&oacute;n un nuevo di&aacute;logo en el que se
            pide introducir cada uno de los elementos del vector. 
            Es equivalente a seleccionar el icono del ordenador de la 
            <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Generar datos aleatorios</h2>
        <p> Muestra un di&aacute;logo en el que se pide introducir el tama&ntilde;o del vector,
            el tipo de generaci&oacute;n aleatoria y, opcionalmente, los l&iacute;mites inferior
            y superior de los elementos del vector aleatorio a generar.
            Es equivalente a seleccionar el icono del dado de la 
            <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Cargar datos</h2>
        <p> Muestra un di&aacute;logo en el que se pide seleccionar un fichero de texto
            con los datos del vector. Es equivalente a seleccionar el icono de la
            carpeta de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Modificar datos</h2>
        <p> Muestra un di&aacute;logo en el que se permite modificar cada uno de los 
            elementos del vector. Es equivalente a seleccionar el icono de la libreta
            de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Almacenar fichero</h2>
        <p> Muestra un di&aacute;logo en el que se pide seleccionar un fichero de texto
            en el que se quiere guardar el vector. Es equivalente a seleccionar el
            icono del disco de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Exportar imagen</h2>
        <p> Muestra un di&aacute;logo en el que se pide seleccionar un fichero con formato
            <em>jpg</em> o <em>png</em> en el que se quiere guardar la visualizaci&oacute;n actual de la 
            traza acumulativa. Es equivalente a seleccionar el icono de la imagen de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Exportar secuencia de im&aacute;genes</h2>
        <p> Muestra un di&aacute;logo en el que se pide seleccionar un directorio, en el 
            que se quiere guardar la secuencia de im&aacute;genes de las trazas acumulativas que conforman la 
            ejecuci&oacute;n completa del algoritmo. Es equivalente a seleccionar el icono del mosaico de im&aacute;genes
            de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Exportar animaci&oacute;n</h2>
        <p> Muestra un di&aacute;logo en el que se pide seleccionar un fichero con formato
            <em>gif</em>, en el que se quiere guardar la animaci&oacute;n de las trazas acumulativas
            que conforman la ejecuci&oacute;n completa del algoritmo. Es equivalente a seleccionar
            el icono de la cinta de v&iacute;deo de la <a href="BarraIconos.html">barra de iconos</a>.</p>

        <h2>Salir</h2>
        <p> Muestra un di&aacute;logo en el que se pide confirmaci&oacute;n para cerrar la aplicaci&oacute;n.</p>
        <br>
        <a href="OpcionesMenu.html">Volver al &iacute;ndice</a>
        <br><br>
    </body>
</html>